EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_timer.h
/*************************************************************************************************************
 * @file    reg_timer.h
 * @version V1.1
 * @date    2022-01-18
 * @brief   
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/


#ifndef __REG_TIMER_H__
#define __REG_TIMER_H__


#ifdef __cplusplus
extern "C" {
#endif


//=====================================================================================================================
// TYPEDEF ENUM
//=====================================================================================================================
typedef enum
{
    TIMER_CHA   = 0x02, /* 16-bit TimerA */
    TIMER_CHB   = 0x01, /* 16-bit TimerB */
    TIMER_CHAB  = 0x07, /* 32-bit Timer */

} EN_TIMER_CH_T;

#define IS_VALID_TIMER_CH(CH) ((CH) == TIMER_CHA   || \
                               (CH) == TIMER_CHB   || \
                               (CH) == TIMER_CHAB)

typedef enum
{
    IR_CHB    = 0x01, /* 16bit TimerB IR */
    IR_CHA    = 0x02, /* 16bit TimerA IR */
    IR_CHAB   = 0x07, /* 32bit Timer IR */
    
} EN_IR_CH_T;

#define IS_VALID_IR_CH(CH) ((CH) == IR_CHB   || \
                            (CH) == IR_CHA   || \
                            (CH) == IR_CHAB)

typedef enum
{
    TIMER_CLK_DIV1   = 0,
    TIMER_CLK_DIV2   = 1,
    TIMER_CLK_DIV4   = 3,
    TIMER_CLK_DIV8   = 7,
    TIMER_CLK_DIV16  = 15,

} EN_TIMER_CLK_T;


//=====================================================================================================================
// TYPEDEF STRUCT
//=====================================================================================================================
typedef struct
{
    __OM  uint32_t TIMER_CFG_EN;           /* [0x00](WO) */
    __IM  uint32_t TIMER_CFG_FLAG;         /* [0x04](RO) */
    __OM  uint32_t TIMER_CFG_CLR;          /* [0x08](WO) */
    __IOM uint32_t TIMER_MODE;             /* [0x0C](RW) */
    __IOM uint32_t TIMER_CFG;              /* [0x10](RW) */
    __OM  uint32_t TIMER_TRIG;             /* [0x14](WO) */
    __IM  uint32_t TIMER_CNT;              /* [0x18](RO) */
    __IOM uint32_t TIMER_COMPARE;          /* [0x1C](RW) */
    __IM  uint32_t TIMER_CHAB_CAP_CNT;     /* [0x20](RO) */
    __IM  uint32_t TIMER_CHA_CAP_CNT;      /* [0x24](RO) */
    __IM  uint32_t TIMER_CHB_CAP_CNT;      /* [0x28](RO) */
    __IOM uint32_t TIMER_DECODE_INTVAL;    /* [0x2C](RW) */
    __IOM uint32_t TIMER_PWM_CNT_LO;       /* [0x30](RW) */
    __IOM uint32_t TIMER_PWM_CNT_HI;       /* [0x34](RW) */
    __IM  uint32_t TIMER_CHB_INT_FLAG;     /* [0x38](RO) */
    __OM  uint32_t TIMER_CHB_INT_CLR;      /* [0x3c](WO) */
    __IOM uint32_t TIMER_CHB_INT_EN;       /* [0x40](RW) */
    __IM  uint32_t TIMER_CHA_INT_FLAG;     /* [0x44](RO) */
    __OM  uint32_t TIMER_CHA_INT_CLR;      /* [0x48](WO) */
    __IOM uint32_t TIMER_CHA_INT_EN;       /* [0x4C](RW) */
    __IOM uint32_t TIMER_CHA_CTRL;         /* [0x50](RW) */
    __IOM uint32_t TIMER_CHB_CTRL;         /* [0x54](RW) */
    __IM  uint32_t TIMER_CHA_WORK_FLAG;    /* [0x58](RO) */
    __IM  uint32_t TIMER_CHB_WORK_FLAG;    /* [0x5C](RO) */
    __IM  uint32_t TIMER_WAKEUP_FLAG;      /* [0x60](RO) */
          uint32_t RESERVED[8];            /* [0x64~0x80] */

    __IOM uint32_t TIMER_EXT_CG_EN;        /* [0x84](RW) */

} stTIMER_Handle_t, *pstTIMER_Handle_t;


#define IS_VALID_TIMER_HANDLE(pstTIMER)  ((TIMER0) == (pstTIMER) \
                                       || (TIMER1) == (pstTIMER) \
                                       || (TIMER2) == (pstTIMER) \
                                       || (TIMER3) == (pstTIMER))

#define IS_VALID_IR_HANDLE(pstIR)        ((IR0) == (pstIR) \
                                       || (IR1) == (pstIR) \
                                       || (IR2) == (pstIR) \
                                       || (IR3) == (pstIR))


//=====================================================================================================================
// [0x00](WO) TIMER_CFG_EN
//=====================================================================================================================
//=============================================================================
// TIMER_CFG_EN[1:0] TIMER_CFG_EN Define
#define TIMER_CFG_EN_SHIFT                 (0)
#define TIMER_CFG_EN_MSK                   ((0x01 << 2) - 1)


//=====================================================================================================================
// [0x04](RO) TIMER_CFG_FLAG
//=====================================================================================================================
//=============================================================================
// TIMER_CFG_FLAG[1:0] TIMER_CFG_FLAG Define
#define TIMER_CFG_FLAG_SHIFT               (0)
#define TIMER_CFG_FLAG_MSK                 ((0x01 << 2) - 1)


