EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_timer.h
//=====================================================================================================================
// [0x08](WO) TIMER_CFG_CLR
//=====================================================================================================================
//=============================================================================
// TIMER_CFG_CLR[1:0] TIMER_CFG_CLR Define
#define TIMER_CFG_CLR_SHIFT                (0)
#define TIMER_CFG_CLR_MSK                  ((0x01 << 2) - 1)


//=====================================================================================================================
// [0x0C](RW) TIMER_MODE
//=====================================================================================================================
//=============================================================================
// TIMER_MODE[7:6] IR_SEND_PATH Define
#define IR_SEND_PATH_SHIFT                 (6)
#define IR_SEND_PATH_MSK                   ((0x01 << 2) - 1)

typedef enum
{
    IR_SEND_DEFAULT_PATH = 0,
    IR_SEND_BY_IR_TX_PIN = 1,
    IR_SEND_BY_GPIO      = 2,
    IR_SEND_BY_BOTH      = 3,

} EN_IR_SEND_PATH_T;

#define IS_VALID_IR_SEND_PATH(PATH)   (IR_SEND_BY_BOTH >= (PATH))

//=============================================================================
// TIMER_MODE[5] TIMER_CAP_CHB_SRC Define
#define TIMER_CAP_CHB_SRC_SHIFT            (5)
#define TIMER_CAP_CHB_SRC_MSK              ((0x01 << 1) - 1)

typedef enum
{
    TIMER_CAP_CHB_SRC_GPIO_IR = 0,
    TIMER_CAP_CHB_SRC_DECODE  = 1,

} EN_CAP_CHB_SRC_T;

#define IS_VALID_CAP_CHB_SRC(SRC)   (TIMER_CAP_CHB_SRC_DECODE >= (SRC))

//=============================================================================
// TIMER_MODE[4] IR_EN Define
#define IR_EN_SHIFT                        (4)
#define IR_EN_MSK                          ((0x01 << 1) - 1)

//=============================================================================
// TIMER_MODE[3] IR_POL Define
#define IR_POL_SHIFT                       (3)
#define IR_POL_MSK                         ((0x01 << 1) - 1)

typedef enum
{
    IR_POL_FALLING = 0,     /* High to low: ---____ */
    IR_POL_RISING  = 1,     /* Low to high: ____--- */

} EN_IR_POL_T;

#define IS_VALID_IR_POL(POL)   (((POL) == IR_POL_RISING) || \
                                ((POL) == IR_POL_FALLING))

//=============================================================================
// TIMER_MODE[2:0] TIMER_MODE Define
#define TIMER_MODE_SHIFT                   (0)
#define TIMER_MODE_MSK                     ((0x01 << 3) - 1)


//=====================================================================================================================
// [0x10](RW) TIMER_CFG
//=====================================================================================================================
//=============================================================================
// TIMER_CFG[31] PWM_CHA_EN Define
#define PWM_CHA_EN_SHIFT                   (31)
#define PWM_CHA_EN_MSK                     ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[30] PWM_CHA_POL Define
#define PWM_CHA_POL_SHIFT                  (30)
#define PWM_CHA_POL_MSK                    ((0x01 << 1) - 1)

typedef enum
{
    PWM_POL_RISING  = 0,    /* Low to high: ____--- */
    PWM_POL_FALLING = 1,    /* High to low: ---____ */

} EN_PWM_POL_T;

#define IS_VALID_PWM_POLARITY(POL)   (((POL) == PWM_POL_RISING) || \
                                      ((POL) == PWM_POL_FALLING))

//=============================================================================
// TIMER_CFG[29] DECODE_CHA_EN Define
#define DECODE_CHA_EN_SHIFT                (29)
#define DECODE_CHA_EN_MSK                  ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[28] DECODE_CHA_POL Define
#define DECODE_CHA_POL_SHIFT               (28)
#define DECODE_CHA_POL_MSK                 ((0x01 << 1) - 1)

typedef enum
{
    DECODE_POL_IDEL_LOW_LEVEL   = 0x00,
    DECODE_POL_IDEL_HIGH_LEVEL  = 0x01,

} EN_DECODE_POL_T;

#define IS_VALID_DECODE_POL(POL)   (DECODE_POL_IDEL_HIGH_LEVEL >= (POL))

//=============================================================================
// TIMER_CFG[27:26] DECODE_CHA_MODE Define
#define DECODE_CHA_MODE_SHIFT              (26)
#define DECODE_CHA_MODE_MSK                ((0x01 << 2) - 1)

typedef enum
{
    DECODE_MODE_POS_EDGE  = 1,  /* __-- */
    DECODE_MODE_NEG_EDGE  = 2,  /* --__ */
    DECODE_MODE_BOTH_EDGE = 3,  /* __-- & --__ */

} EN_DECODE_MODE_T;

#define IS_VALID_DECODE_MODE(MODE)   (DECODE_MODE_BOTH_EDGE >= (MODE))

//=============================================================================
// TIMER_CFG[25] CAP_CHA_EN Define
#define CAP_CHA_EN_SHIFT                   (25)
#define CAP_CHA_EN_MSK                     ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[24] CAP_CHA_SIGNAL_SEL Define
#define CAP_CHA_SIGNAL_SEL_SHIFT           (24)
#define CAP_CHA_SIGNAL_SEL_MSK             ((0x01 << 1) - 1)

typedef enum
{
    CAP_DECODE_SIGNAL_GPIO  = 0x00,
    CAP_DECODE_SIGNAL_IR    = 0x01,

} EN_CAP_DECODE_SIGNAL_T;

#define IS_VALID_CAP_DECODE_SIGNAL(SIGNAL) (CAP_DECODE_SIGNAL_GPIO == (SIGNAL) \
                                         || CAP_DECODE_SIGNAL_IR)

//=============================================================================
// TIMER_CFG[23:22] CAP_CHA_MODE Define
#define CAP_CHA_MODE_SHIFT                 (22)
#define CAP_CHA_MODE_MSK                   ((0x01 << 2) - 1)

typedef enum
{
    CAP_MODE_POS_EDGE  = 0x01, /* __-- */
    CAP_MODE_NEG_EDGE  = 0x02, /* --__ */
    CAP_MODE_BOTH_EDGE = 0x03, /* __-- & --__ */

} EN_CAP_MODE_T;

#define IS_VALID_CAP_MODE(MODE) (CAP_MODE_POS_EDGE == (MODE) \
                              || CAP_MODE_NEG_EDGE == (MODE) \
                              || CAP_MODE_BOTH_EDGE == (MODE))

//=============================================================================
// TIMER_CFG[21:18] TIMER_CHA_PRESCALE Define
#define TIMER_CHA_PRESCALE_SHIFT           (18)
#define TIMER_CHA_PRESCALE_MSK             ((0x01 << 4) - 1)

