EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_timer.h
//=============================================================================
// TIMER_CFG[17:16] TIMER_CHA_CNT_MODE Define
#define TIMER_CHA_CNT_MODE_SHIFT           (16)
#define TIMER_CHA_CNT_MODE_MSK             ((0x01 << 2) - 1)

typedef enum
{
    TIMER_CNT_MODE_CONTINU         = 0x00, /* The timer repeatedly counts from zero to 0xFFFF(or 0xFFFFFFFF) */
    TIMER_CNT_MODE_UP              = 0x01, /* The timer repeatedly counts from zero to the value of compare */
    TIMER_CNT_MODE_CONTINU_UP_DOWN = 0x02, /* The timer repeatedly counts from zero up to 0xFFFF(or 0xFFFFFFFF)
                                              and back down to zero. */
    TIMER_CNT_MODE_UP_DOWN         = 0x03, /* The timer repeatedly counts from zero up to the value of compare
                                              and back down to zero. */

} EN_TIMER_CNT_MODE_T;

#define IS_VALID_TIMER_CNT_MODE(MODE)    (TIMER_CNT_MODE_CONTINU         == (MODE)\
                                       || TIMER_CNT_MODE_UP              == (MODE)\
                                       || TIMER_CNT_MODE_CONTINU_UP_DOWN == (MODE)\
                                       || TIMER_CNT_MODE_UP_DOWN         == (MODE))

//=============================================================================
// TIMER_CFG[15] PWM_CHB_EN Define
#define PWM_CHB_EN_SHIFT                   (15)
#define PWM_CHB_EN_MSK                     ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[14] PWM_CHB_POL Define
#define PWM_CHB_POL_SHIFT                  (14)
#define PWM_CHB_POL_MSK                    ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[13] DECODE_CHB_EN Define
#define DECODE_CHB_EN_SHIFT                (13)
#define DECODE_CHB_EN_MSK                  ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[12] DECODE_CHB_POL Define
#define DECODE_CHB_POL_SHIFT               (12)
#define DECODE_CHB_POL_MSK                 ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[11:10] DECODE_CHA_MODE Define
#define DECODE_CHB_MODE_SHIFT              (10)
#define DECODE_CHB_MODE_MSK                ((0x01 << 2) - 1)

//=============================================================================
// TIMER_CFG[9] CAP_CHB_EN Define
#define CAP_CHB_EN_SHIFT                   (9)
#define CAP_CHB_EN_MSK                     ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[8] CAP_CHB_SIGNAL_SEL Define
#define CAP_CHB_SIGNAL_SEL_SHIFT           (8)
#define CAP_CHB_SIGNAL_SEL_MSK             ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CFG[7:6] CAP_CHB_MODE Define
#define CAP_CHB_MODE_SHIFT                 (6)
#define CAP_CHB_MODE_MSK                   ((0x01 << 2) - 1)

//=============================================================================
// TIMER_CFG[5:2] TIMER_CHB_PRESCALE Define
#define TIMER_CHB_PRESCALE_SHIFT           (2)
#define TIMER_CHB_PRESCALE_MSK             ((0x01 << 4) - 1)

//=============================================================================
// TIMER_CFG[1:0] TIMER_CHB_CNT_MODE Define
#define TIMER_CHB_CNT_MODE_SHIFT           (0)
#define TIMER_CHB_CNT_MODE_MSK             ((0x01 << 2) - 1)


//=====================================================================================================================
// [0x14](WO) TIMER_TRIG
//=====================================================================================================================
//=============================================================================
// TIMER_TRIG[6] TIMER_CHA_CLR Define
#define TIMER_CHA_CLR_SHIFT                (6)
#define TIMER_CHA_CLR_MSK                  ((0x01 << 1) - 1)

//=============================================================================
// TIMER_TRIG[5] TIMER_CHA_STOP Define
#define TIMER_CHA_STOP_SHIFT               (5)
#define TIMER_CHA_STOP_MSK                 ((0x01 << 1) - 1)

// TIMER_TRIG[4] TIMER_CHA_START Define
#define TIMER_CHA_START_SHIFT              (4)
#define TIMER_CHA_START_MSK                ((0x01 << 1) - 1)

//=============================================================================
// TIMER_TRIG[2] TIMER_CHB_CLR Define
#define TIMER_CHB_CLR_SHIFT                (2)
#define TIMER_CHB_CLR_MSK                  ((0x01 << 1) - 1)

//=============================================================================
// TIMER_TRIG[1] TIMER_CHB_STOP Define
#define TIMER_CHB_STOP_SHIFT               (1)
#define TIMER_CHB_STOP_MSK                 ((0x01 << 1) - 1)

//=============================================================================
// TIMER_TRIG[0] TIMER_CHB_START Define
#define TIMER_CHB_START_SHIFT              (0)
#define TIMER_CHB_START_MSK                ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x18](RO) TIMER_CNT
//=====================================================================================================================
//=============================================================================
// TIMER_CNT[31:16] TIMER_CHA_CNT Define
#define TIMER_CHA_CNT_SHIFT                (16)
#define TIMER_CHA_CNT_MSK                  ((0x01 << 16) - 1)

//=============================================================================
// TIMER_CNT[15:0] TIMER_CHB_CNT Define
#define TIMER_CHB_CNT_SHIFT                (0)
#define TIMER_CHB_CNT_MSK                  ((0x01 << 16) - 1)

#define TIMER_CNT_MSK                      (WORD_MSK)


//=====================================================================================================================
// [0x1C](RW) TIMER_COMPARE
//=====================================================================================================================
//=============================================================================
// TIMER_COMPARE[31:16] TIMER_CHA_COMPARE Define
#define TIMER_CHA_COMPARE_SHIFT            (16)
#define TIMER_CHA_COMPARE_MSK              ((0x01 << 16) - 1)

