EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_timer.h
//=============================================================================
// TIMER_COMPARE[15:0] TIMER_CHB_COMPARE Define
#define TIMER_CHB_COMPARE_SHIFT            (0)
#define TIMER_CHB_COMPARE_MSK              ((0x01 << 16) - 1)

//=============================================================================
// TIMER_COMPARE[31:0] TIMER_CHAB_COMPARE Define
#define TIMER_COMPARE_SHIFT                (0)
#define TIMER_COMPARE_MSK                  (WORD_MSK)


//=====================================================================================================================
// [0x20](RO) TIMER_CHAB_CAP_CNT
//=====================================================================================================================
//=============================================================================
// TIMER_CHAB_CAP_CNT[31:0] TIMER_CHAB_CAP_CNT Define
#define TIMER_CHAB_CAP_CNT_SHIFT           (0)
#define TIMER_CHAB_CAP_CNT_MSK             (WORD_MSK)


//=====================================================================================================================
// [0x24](RO) TIMER_CHA_CAP_CNT
//=====================================================================================================================
//=============================================================================
// TIMER_CHA_CAP_CNT[15:0] TIMER_CHA_CAP_CNT Define
#define TIMER_CHA_CAP_CNT_SHIFT            (0)
#define TIMER_CHA_CAP_CNT_MSK              ((0x01 << 16) - 1)


//=====================================================================================================================
// [0x28](RO) TIMER_CHB_CAP_CNT
//=====================================================================================================================
//=============================================================================
// TIMER_CHB_CAP_CNT[15:0] TIMER_CHB_CAP_CNT Define
#define TIMER_CHB_CAP_CNT_SHIFT            (0)
#define TIMER_CHB_CAP_CNT_MSK              ((0x01 << 16) - 1)


//=====================================================================================================================
// [0x2C](RW) TIMER_DECODE_INTVAL
//=====================================================================================================================
//=============================================================================
// TIMER_DECODE_INTVAL[15:8] DECODE_CHA_INTVAL Define
#define DECODE_CHA_INTVAL_SHIFT            (8)
#define DECODE_CHA_INTVAL_MSK              ((0x01 << 8) - 1)

//=============================================================================
// TIMER_DECODE_INTVAL[7:0] DECODE_CHB_INTVAL Define
#define DECODE_CHB_INTVAL_SHIFT            (0)
#define DECODE_CHB_INTVAL_MSK              ((0x01 << 8) - 1)


//=====================================================================================================================
// [0x30](RW) TIMER_PWM_CNT_LO
//=====================================================================================================================
//=============================================================================
// TIMER_PWM_CNT_LO[31:16] PWM_CHA_CNT_LO Define
#define PWM_CHA_CNT_LO_SHIFT               (16)
#define PWM_CHA_CNT_LO_MSK                 ((0x01 << 16) - 1)

//=============================================================================
// TIMER_PWM_CNT_LO[15:0] PWM_CHB_CNT_LO Define
#define PWM_CHB_CNT_LO_SHIFT               (0)
#define PWM_CHB_CNT_LO_MSK                 ((0x01 << 16) - 1)

//=============================================================================
// TIMER_PWM_CNT_LO[31:0] PWM_CHAB_CNT_LO Define
#define PWM_CHAB_CNT_LO_SHIFT              (0)
#define PWM_CHAB_CNT_LO_MSK                (WORD_MSK)


//=====================================================================================================================
// [0x34](RW) TIMER_PWM_CNT_HI
//=====================================================================================================================
//=============================================================================
// TIMER_PWM_CNT_HI[31:16] PWM_CHA_CNT_HI Define
#define PWM_CHA_CNT_HI_SHIFT               (16)
#define PWM_CHA_CNT_HI_MSK                 ((0x01 << 16) - 1)

//=============================================================================
// TIMER_PWM_CNT_HI[15:0] PWM_CHB_CNT_HI Define
#define PWM_CHB_CNT_HI_SHIFT               (0)
#define PWM_CHB_CNT_HI_MSK                 ((0x01 << 16) - 1)

//=============================================================================
// TIMER_PWM_CNT_HI[31:0] PWM_CHAB_CNT_HI Define
#define PWM_CHAB_CNT_HI_SHIFT              (0)
#define PWM_CHAB_CNT_HI_MSK                (WORD_MSK)


//=====================================================================================================================
// [0x38~0x4C] TIMER_INT_FLAG / TIMER_INT_EN  / TIMER_INT_CLR
//=====================================================================================================================
#define TIMER_INT_CAPTURE_SHIFT            (4)
#define TIMER_INT_DECODE_SHIFT             (3)
#define TIMER_INT_CAP_COV_SHIFT            (2)
#define TIMER_INT_OVERFLOW_SHIFT           (1)
#define TIMER_INT_MATCH_SHIFT              (0)

typedef enum
{
    TIMER_INT_MATCH       = (0x01 << TIMER_INT_MATCH_SHIFT),
    TIMER_INT_OVERFLOW    = (0x01 << TIMER_INT_OVERFLOW_SHIFT),
    TIMER_INT_CAP_COV     = (0x01 << TIMER_INT_CAP_COV_SHIFT),
    TIMER_INT_DECODE      = (0x01 << TIMER_INT_DECODE_SHIFT),
    TIMER_INT_CAPTURE     = (0x01 << TIMER_INT_CAPTURE_SHIFT),

} EN_TIMER_INT_FLAG_T;

#define TIMER_INT_MASK      (0x1F)


//=====================================================================================================================
// [0x40/0x4C](RW) TIMER_INT_EN
//=====================================================================================================================
#define TIMER_WAKEUP_CAPTURE_SHIFT         (9)
#define TIMER_WAKEUP_DECODE_SHIFT          (8)
#define TIMER_WAKEUP_CAP_COV_SHIFT         (7)
#define TIMER_WAKEUP_OVERFLOW_SHIFT        (6)
#define TIMER_WAKEUP_MATCH_SHIFT           (5)

