EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_timer.h
typedef enum
{
    TIMER_WAKEUP_MATCH       = (0x01 << TIMER_WAKEUP_MATCH_SHIFT),
    TIMER_WAKEUP_OVERFLOW    = (0x01 << TIMER_WAKEUP_OVERFLOW_SHIFT),
    TIMER_WAKEUP_CAP_COV     = (0x01 << TIMER_WAKEUP_CAP_COV_SHIFT),
    TIMER_WAKEUP_DECODE      = (0x01 << TIMER_WAKEUP_DECODE_SHIFT),
    TIMER_WAKEUP_CAPTURE     = (0x01 << TIMER_WAKEUP_CAPTURE_SHIFT)

} EN_TIMER_WAKEUP_SRC_T;

#define TIMER_WAKEUP_MASK    (0x3E0)


//=====================================================================================================================
// [0x50~0x54](RW) TIMER_CTRL
//=====================================================================================================================
//=============================================================================
// TIMER_CTRL[4] TIMR_CAP_TRIGGER_MODE Define
#define TIMR_CAP_TRIGGER_MODE_SHIFT        (4)
#define TIMR_CAP_TRIGGER_MODE_MSK          ((0x01 << 1) - 1)

typedef enum
{
    CAP_TRIG_MODE_DMA = 0x00,
    CAP_TRIG_MODE_INT = 0x01,

} EN_CAP_TRIG_MODE_T;

#define IS_VALID_CAP_TRIG_MODE(MODE)   (CAP_TRIG_MODE_INT >= (MODE))

//=============================================================================
// TIMER_CTRL[3] TIMR_SYNC_START Define
#define TIMR_SYNC_START_SHIFT              (3)
#define TIMR_SYNC_START_MSK                ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CTRL[2] TIMR_SYNC_STOP Define
#define TIMR_SYNC_STOP_SHIFT               (2)
#define TIMR_SYNC_STOP_MSK                 ((0x01 << 1) - 1)

//=============================================================================
// TIMER_CTRL[1] TIMR_CAP_CNT_FORMAT Define
#define TIMR_CAP_CNT_FORMAT_SHIFT          (1)
#define TIMR_CAP_CNT_FORMAT_MSK            ((0x01 << 1) - 1)

typedef enum
{
    CAP_CNT_FORMAT_UNSIGNED = 0,
    CAP_CNT_FORMAT_SIGNED   = 1,

} EN_CAP_CNT_FORMAT_T;

#define IS_VALID_CAP_CNT_FORMAT(FORMAT)   (CAP_CNT_FORMAT_SIGNED >= (FORMAT))

//=============================================================================
// TIMER_CTRL[0] TIMER_COMPARE_VALID_DELAY Define
#define TIMER_COMPARE_VALID_DELAY_SHIFT    (0)
#define TIMER_COMPARE_VALID_DELAY_MSK      ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x58~0x5C](RO) TIMER_WORK_FLAG
//=====================================================================================================================
//=============================================================================
// TIMER_WORK_FLAG[1] TIMER_WORK_STATUS
#define TIMER_WORK_STATUS_SHIFT            (1)
#define TIMER_WORK_STATUS_MSK              ((0x01 << 1) - 1)

typedef enum
{
    TIMER_STATUS_STOP    = 0,
    TIMER_STATUS_RUNNING = 1,

} EN_TIMER_STATUS_T;

//=============================================================================
// TIMER_WORK_FLAG[0] TIMER_COUNTER_MODE Define
#define TIMER_COUNTER_MODE_SHIFT           (0)
#define TIMER_COUNTER_MODE_MSK             ((0x01 << 1) - 1)

typedef enum
{
    TIMER_COUNTER_MODE_DECREASE = 0,
    TIMER_COUNTER_MODE_INCREASE = 1,

} EN_TIMER_COUNTER_MODE_T;


//=====================================================================================================================
// [0x60](RO) TIMER_WAKEUP_FLAG
//=====================================================================================================================
//=============================================================================
// TIMER_WAKEUP_FLAG[1] TIMER_WAKEUP_FLAG
#define TIMER_WAKEUP_FLAG_SHIFT            (0)
#define TIMER_WAKEUP_FLAG_MSK              ((0x01 << 1) - 1)


#ifdef __cplusplus
}
#endif

#endif /* __REG_TIMER_H__ */

